Revit 2026 API

# RibbonPanelTitle Property

---

Gets or sets the text of the RibbonPanel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Title { get; set; }
```
```vb
Public Property Title As String
	Get
	Set
```
```cpp
public:
property String^ Title {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Title : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the title contains angle bracket. |

If this property is not set, the default value is its Name.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace